/* 
Теоретичні питання
1. Як можна визначити, яку саме клавішу клавіатури натиснув користувач?
1. Используя "keydown" и функцию прослушивателя событий, можно узнать клавишу, которую нажимает пользователь.

2. Яка різниця між event.code() та event.key()?
2. event.key - возвращает строку, представляющую физическую клавишу, а event.code - возвращает строку, представляющую физический код клавиши.

3. Які три події клавіатури існує та яка між ними відмінність?
3. Существует два типа событий с клавишами: keydown - появляется, когда пользователь нажимает на клавишу; keyup - появляется, когда пользователь отпускает клавишу.

Практичне завдання.
Реалізувати функцію підсвічування клавіш.

Технічні вимоги:

- У файлі index.html лежить розмітка для кнопок.
- Кожна кнопка містить назву клавіші на клавіатурі
- Після натискання вказаних клавіш - та кнопка, на якій написана ця літера, 
повинна фарбуватися в синій колір. При цьому якщо якась 
інша літера вже раніше була пофарбована в синій колір - 
вона стає чорною. Наприклад за натисканням Enter перша кнопка забарвлюється у 
синій колір. Далі, користувач натискає S, і кнопка S забарвлюється в синій колір, 
а кнопка Enter знову стає чорною.
*/

"use strict";

function makeLedKeys() {
    const buttonList = document.querySelectorAll(".btn");

    buttonList.forEach((button) => {
        button.setAttribute("id", `${button.innerText.toLowerCase()}`);
    });

    window.addEventListener("keydown", (event) => {
        buttonList.forEach((button) => {
            button.className = "btn";
        });

        const pressedButton = document.querySelector(
            `#${event.key.toLowerCase()}`
        );
        pressedButton.classList.add("active");
    });
}

makeLedKeys();
