/* Теоретичні питання
1. Що таке оператори в JavaScript і які їхні типи ви знаєте?
1. Оператор — это элемент языка, задающий полное описание действия, которое необходимо выполнить. Типы операторов:
Операторы присваивания
Арифметические операторы 
Операторы сравнения
Логические операторы 
Побитовые операторы
Операторы строк

2. Для чого використовуються оператори порівняння в JavaScript? Наведіть приклади таких операторів.
2. Операторы сравнения используются в логических инструкциях для определения уравнения или разницы между переменными или значениями. Примеры:
"==", "!=", "===", "!==",">==", "<==", ">=", "<=", "<", >".

3. Що таке операції присвоєння в JavaScript? Наведіть кілька прикладів операцій присвоєння.
Простой оператор присваивания используется для присваивания значения переменной. Примеры:
"=", "+=", "-=", "*=", "/="

Практичні завдання
1. Створіть змінну "username" і присвойте їй ваше ім'я. Створіть змінну "password" і присвойте їй пароль (наприклад, "secret"). 
Далі ми імітуємо введеня паролю користувачем. 
Отримайте від користувача значення його паролю і перевірте, чи співпадає воно зі значенням в змінній "password". 
Виведіть результат порівнння в консоль.

2. Створіть змінну x та присвойте їй значення 5. Створіть ще одну змінну y та запишіть присвойте їй значення 3. 
Виведіть результати додавання, віднімання, множення та ділення 
змінних x та y у вікні alert.

*/

// 1.

/*
const userName = "Mykola";
const password = "123123";
let userPassword = prompt("Enter your password");

if (userPassword === password) {
    console.log(userPassword === password);
} else {
    console.log(userPassword === password);
}
*/

// 2.

/*
const x = 5;
const y = 3;
result1 = x + y;
result2 = x - y;
result3 = x * y;
result4 = x / y;
result = `${result1} ${result2} ${result3} ${result4}`;

alert(result);
*/
