"use strict";

/* 
Теоретичні питання
1. Опишіть своїми словами як працює метод forEach.
1. Метод 'forEach' - итерующийся метод, который перебирает все значения массива, выполняя функцию с ними и всегда возвращает значение undefined.

2. Які методи для роботи з масивом мутують існуючий масив, а які повертають новий масив? Наведіть приклади.
2. Мутирующие методы: 'forEach', 'push', 'unshift', 'pop', 'shift', 'slice'.
Методы, возвращающие новый массив: 'map', 'filter', 'concat'.

3. Як можна перевірити, що та чи інша змінна є масивом?
3. Проверить, является ли переменная массивом, можно с помощью метода 'isArray'.

4. В яких випадках краще використовувати метод map(), а в яких forEach()?
4. Если мы хотим получить новый видоизмененный массив - используем метод map(), а если выполнить функцию для каждого элемента массива - forEach().

Практичні завдання
1. Створіть масив з рядків "travel", "hello", "eat", "ski", "lift" та обчисліть кількість рядків з довжиною більше за 3 символи. Вивести це число в консоль.

2. Створіть масив із 4 об'єктів, які містять інформацію про людей: {name: "Іван", age: 25, sex: "чоловіча"}. Наповніть різними даними. Відфільтруйте його, щоб отримати тільки об'єкти зі sex "чоловіча". 
Відфільтрований масив виведіть в консоль.

3. Реалізувати функцію фільтру масиву за вказаним типом даних. (Опціональне завдання)

Технічні вимоги:

- Написати функцію filterBy(), яка прийматиме 2 аргументи. Перший аргумент - масив, який міститиме будь-які дані, другий аргумент - тип даних.
- Функція повинна повернути новий масив, який міститиме всі дані, які були передані в аргумент, за винятком тих, тип яких був переданий другим аргументом. Тобто якщо передати масив ['hello', 'world', 23, '23', null], і другим аргументом передати 'string', то функція поверне масив [23, null].
 */

// 1.

// const arr = ["travel", "hello", "eat", "ski", "lift"];

// const arr2 = arr.filter((elem) => elem.length > 3);

// console.log(arr2.length);

// 2.

// const names = [
//     {
//         name: "Іван",
//         age: 23,
//         sex: "чоловіча",
//     },
//     {
//         name: "Анна",
//         age: 25,
//         sex: "жіноча",
//     },
//     {
//         name: "Сергій",
//         age: 48,
//         sex: "чоловіча",
//     },
//     {
//         name: "Влада",
//         age: 18,
//         sex: "жіноча",
//     },
// ];

// const filteredNames = names.filter((elem) => elem.sex === "жіноча");

// console.log(filteredNames);

// 3.

const arr = ["hello", "world", 23, "23", null];

function filterBy(arr, arg) {
    const arr2 = arr.filter((elem) => typeof elem !== typeof arg);
    return arr2;
}

console.log(filterBy(arr, "string"));
