/* 
Теоретичні питання
1. Що таке логічний оператор?
1. Логические операторы это специальные символы, которые изменяют или комбинируют логические значения типа Boolean — true и false.

2. Які логічні оператори є в JavaScript і які їх символи?
2. || (АБО), && (І), ! (НЕ), ?? (оператор null-об’єднання).

Практичні завдання.
1. Попросіть користувача ввести свій вік за допомогою prompt. 
Якщо вік менше 12 років, виведіть у вікні alert повідомлення про те, 
що він є дитиною, якщо вік менше 18 років, виведіть повідомлення про те, 
що він є підлітком, інакше виведіть повідомлення про те, що він є дорослим.

Завдання з підвищенною складністю.
Перевірте чи ввів користувач саме число в поле prompt. Якщо ні, то виведіть повідомлення, що введено не число.

2. Напишіть програму, яка запитує у користувача місяць року (українською мовою маленкими літерами) та виводить повідомлення, 
скільки днів у цьому місяці. Результат виводиться в консоль.
Скільки днів в кожному місяці можна знайти тут в розділі Юліанський і Григоріанський календарі - https://uk.wikipedia.org/wiki/%D0%9C%D1%96%D1%81%D1%8F%D1%86%D1%8C_(%D1%87%D0%B0%D1%81)
(Використайте switch case)

// 1.
const userAge = prompt("Введите свой возраст");

if (isNaN(userAge)) {
    alert("Вы ввели не число");
} else {
    if (userAge < "18") {
        if (userAge < "12") {
            alert("Вы ребенок");
        }
        alert("Вы подросток");
    } else {
        alert("Вы взрослый");
    }
}

// 2.

const userMonth = prompt("Введіть будь-який місяць");

switch (userMonth) {
    case "січень": {
        console.log(31);
        break;
    }
    case "лютий": {
        console.log(28);
        break;
    }
    case "березень": {
        console.log(31);
        break;
    }
    case "квітень": {
        console.log(30);
        break;
    }
    case "травень": {
        console.log(31);
        break;
    }
    case "червень": {
        console.log(30);
        break;
    }
    case "липень": {
        console.log(31);
        break;
    }
    case "серпень": {
        console.log(31);
        break;
    }
    case "вересень": {
        console.log(30);
        break;
    }
    case "жовтень": {
        console.log(31);
        break;
    }
    case "листопад": {
        console.log(30);
    }
    case "грудень": {
        console.log(31);
    }
}

*/
